InformationRegisters/СвязиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СвязиДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйДокументОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсходящихДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСвязей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееСообщениеСВД</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсходящихДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязаннаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВнутреннихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныВходящихДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбращенияКОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОбращенияКОбъектам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоОбращения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаДелВАрхив</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
						<v8:Type>cfg:DocumentRef.УничтожениеДел</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКоллекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Comment>Например, "ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Comment>Например, "ПланВидовХарактеристик.ОбъектыАдресацииЗадач"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйСиноним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПустойСсылки</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбъектаМетаданных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоваяСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СвязиДокументов/Forms/СозданиеСвязи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УникальныйИдентификаторФормыВладельца") Тогда 
		УникальныйИдентификаторФормыВладельца = Параметры.УникальныйИдентификаторФормыВладельца;
	КонецЕсли;
	
	Параметры.Свойство("Документ", Документ);
	Параметры.Свойство("СвязанныйДокумент", СвязанныйДокумент);
	Параметры.Свойство("ТипСвязи", ТекущийТипСвязи);
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ВестиУчетОбращенийГраждан = ПолучитьФункциональнуюОпцию("ВестиУчетОбращенийГраждан"); 
	ВнешнийРесурс = НСтр("ru = 'Внешняя ссылка'; en = 'External link'");
	ДокументТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 (%2)'; en = '%1 (%2)'"), Документ, ТипЗнч(Документ));
		
	Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда 
		ОткрыватьФорму = Истина;
		ТекстОшибки = "";
		ПерейтиКСозданиюСвязи();
	Иначе 
		УстановитьТипыСвязуемыхОбъектов();
		
		Если ТипыПредмета.Количество() > 0 Тогда 			
			ПостроитьДеревоВариантов();
		КонецЕсли;
	КонецЕсли;	

	Элементы.Назад.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
		ПоказатьПредупреждение(, ТекстОшибки);
		Отказ = Истина;
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СвязанныйДокумент) И ТипыПредмета.Количество() = 0 Тогда 			
		ПоказатьПредупреждение(, НСтр(
			"ru = 'Нельзя установить связь, так как для выбранного объекта не настроено ни одного типа связи'; en = 'You cannot establish a relation, as the selected object is not configured for any type of relationship'"));
		Отказ = Истина;
		Возврат;
    КонецЕсли;
	
	ЭлементыДерева = ДеревоВариантов.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Развернуть = Ложь;
		
		Если СтруктураРазвернутости <> Неопределено Тогда
			СтруктураРазвернутости.Свойство(ЭлементДерева.КомандаСсылка, Развернуть);
		Иначе
			Развернуть = Истина;
		КонецЕсли;
		
		Если Развернуть = Истина Или Развернуть = Неопределено Тогда
			Элементы.ДеревоВариантов.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		СвязанныйДокумент = ВыбранноеЗначение; 
		ТекстОшибки = "";
		ПерейтиКСозданиюСвязи();
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("СтруктураРазвернутости", СтруктураРазвернутости);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	СтруктураРазвернутости = Настройки.Получить("СтруктураРазвернутости");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументТекстОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Документ);

КонецПроцедуры

&НаКлиенте
Процедура СвязанныйДокументТекстОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, СвязанныйДокумент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоВариантов

&НаКлиенте
Процедура ДеревоВариантовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОчиститьСообщения();
	ВыбратьПредметКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоВариантов.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы.ДеревоВариантовКонтекстноеМенюОткрытьКарточку.Доступность =
		(ТипЗнч(Элементы.ДеревоВариантов.ТекущиеДанные.КомандаСсылка) <> Тип("Строка"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовПередНачаломИзменения(Элемент, Отказ)
		
	Отказ = Истина;

	Если ТипЗнч(Элементы.ДеревоВариантов.ТекущиеДанные.КомандаСсылка) <> Тип("Строка") Тогда 
		ПоказатьЗначение(, Элементы.ДеревоВариантов.ТекущиеДанные.КомандаСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовПередРазворачиванием(Элемент, Строка, Отказ)
	
	СохранитьПараметрыРазвернутости(Строка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовПередСворачиванием(Элемент, Строка, Отказ)
	
	СохранитьПараметрыРазвернутости(Строка, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыСвязей

&НаКлиенте
Процедура ТипыСвязейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Готово(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьКарточку(Команда)
	
	ПоказатьЗначение(, Элементы.ДеревоВариантов.ТекущиеДанные.КомандаСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСозданиеСвязи Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборДокумента;	
		Элементы.Готово.Заголовок = НСтр("ru = 'Далее >'; en = 'Next >'");
		Элементы.Назад.Видимость = Ложь;
		ИзменитьПодсказку();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)

	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборДокумента Тогда 	
		ТекущиеДанные = Элементы.ДеревоВариантов.ТекущиеДанные;
		ОчиститьСообщения();
		
		Если ТекущиеДанные = Неопределено 
			ИЛИ ТекущиеДанные.ЭтоЗаголовок Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбран связанный документ'; en = 'Related document is not selected'"));
			Возврат;
		КонецЕсли;

		Если ТипЗнч(ТекущиеДанные.КомандаСсылка) = Тип("Строка") 
			И ТекущиеДанные.КомандаСсылка = ВнешнийРесурс Тогда
		    ОписаниеОповещения = Новый ОписаниеОповещения(
				"ДобавлениеВнешнегоРесурсаЗавершение",
				ЭтотОбъект);
			ОткрытьФорму("РегистрСведений.СвязиДокументов.Форма.ФормаВнешнегоРесурса",,
				ЭтаФорма,,,,
				ОписаниеОповещения,
				РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		ИначеЕсли ТипЗнч(ТекущиеДанные.КомандаСсылка) = Тип("Строка") Тогда
			ИмяФормыВыбора = ТекущиеДанные.КомандаСсылка + ".ФормаВыбора";
			Если ТекущиеДанные.КомандаСсылка = "Справочник.Файлы" Тогда
				ИмяФормыВыбора = "Справочник.Файлы.Форма.ФормаВыбораФайлаВПапках";
			КонецЕсли;
			ПараметрыФормы = Новый Структура;
			ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, ЭтаФорма);
		
		Иначе
			СвязанныйДокумент = ТекущиеДанные.КомандаСсылка;
			ТекстОшибки = "";
			ПерейтиКСозданиюСвязи();
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ПоказатьПредупреждение(, ТекстОшибки);
			КонецЕсли;
		
		КонецЕсли;
		
	Иначе 
		ТекущиеДанные = Элементы.ТипыСвязей.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено 
			Или Не ЗначениеЗаполнено(Документ)
			Или Не ЗначениеЗаполнено(СвязанныйДокумент)Тогда
			Возврат;
		КонецЕсли;

		ТипСвязи = ТекущиеДанные.Значение;
		СоздатьСвязь(ТипСвязи);
			
		// Оповещение об изменении связей документа
		ТипыСвязейМассив = Новый Массив;
		ТипыСвязейМассив.Добавить(ТипСвязи);
		
		ПараметрСобытия = Новый Структура;
		ПараметрСобытия.Вставить("Документ", Документ);
		ПараметрСобытия.Вставить("ТипыСвязей", ТипыСвязейМассив);
		ПараметрСобытия.Вставить("СвязанныйДокумент", СвязанныйДокумент);
		Оповестить("ИзмененыСвязиДокумента", ПараметрСобытия, ЭтаФорма);
		
		// Оповещение об изменении реквизитов документа
		Если РеквизитыВладельцаИзменены Тогда 
			Оповестить("ИзмененыРеквизитыПриИзмененииСвязи", Документ, ЭтаФорма);
		КонецЕсли;	
	
		Закрыть();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТипыСвязуемыхОбъектов()
	
	НастройкиСвязей = СвязиДокументов.ПолучитьНастройкиСвязи(Документ, СвязанныйДокумент);
	ДобавитьВнешнююСсылку = Ложь;
	
	Для Каждого ТипСвязи Из НастройкиСвязей Цикл
		ТипМетаданных = ТипСвязи.ТипСсылкаНа;
		
		Если Не СвязиДокументов.ЭтоПодходящийТипСвязи(Документ, СвязанныйДокумент, ТипСвязи.ТипСвязи) Тогда
			Продолжить;
		КонецЕсли;

		Если ТипМетаданных = "Строка" Тогда
			Если Не ДобавитьВнешнююСсылку 
				И ТипыПредмета.НайтиПоЗначению(ВнешнийРесурс) = Неопределено Тогда 
				ДобавитьВнешнююСсылку = Истина;
			КонецЕсли;
		Иначе 	
			ПредметСсылка = Новый(ТипМетаданных);
			ЭлементМетаданных = ПредметСсылка.Метаданные();
			
			Если ТипыПредмета.НайтиПоЗначению(ЭлементМетаданных.ПолноеИмя()) = Неопределено 
			И ПравоДоступа("Чтение", ЭлементМетаданных) Тогда  			
				ПредставлениеОбъекта = ЭлементМетаданных.ПредставлениеОбъекта;
				
				Если ПустаяСтрока(ПредставлениеОбъекта) Тогда
					ПредставлениеОбъекта = Строка(ЭлементМетаданных);
				КонецЕсли;
				
				ТипыПредмета.Добавить(ЭлементМетаданных.ПолноеИмя(), ПредставлениеОбъекта);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТипыПредмета.СортироватьПоПредставлению();
	
	//Добавим данный тип предмета в конец списка, т.к. он не часто используется
	Если ДобавитьВнешнююСсылку Тогда 
		ТипыПредмета.Добавить(ВнешнийРесурс, ВнешнийРесурс);	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДеревоВариантов()
	
	Дерево = РеквизитФормыВЗначение("ДеревоВариантов");
	Дерево.Строки.Очистить();
	
	ПолучитьНедавниеДокументы(Дерево);
	ПолучитьВозможныеДокументы(Дерево);
	
	ЗначениеВДанныеФормы(Дерево, ДеревоВариантов);

КонецПроцедуры

&НаСервере
Процедура ПолучитьНедавниеДокументы(Дерево)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		|	РегистрСведенийОбращенияКОбъектам.Объект,
		|	РегистрСведенийОбращенияКОбъектам.ДатаПоследнегоОбращения КАК ДатаПоследнегоОбращения
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбращенияКОбъектам КАК РегистрСведенийОбращенияКОбъектам
		|		ПО (ТИПЗНАЧЕНИЯ(ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки) = ТИПЗНАЧЕНИЯ(РегистрСведенийОбращенияКОбъектам.Объект))
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.ПолноеИмя В(&ТипыПредметов)
		|	И РегистрСведенийОбращенияКОбъектам.Пользователь = &ТекущийПользователь
		|	И НЕ РегистрСведенийОбращенияКОбъектам.Объект.ПометкаУдаления
		|	И РегистрСведенийОбращенияКОбъектам.Объект <> &Документ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПоследнегоОбращения УБЫВ";
		
	Запрос.УстановитьПараметр("ТекущийПользователь", ПользователиКлиентСервер.ТекущийПользователь());
	Запрос.УстановитьПараметр("ТипыПредметов", ТипыПредмета); 
	Запрос.УстановитьПараметр("Документ", Документ); 
	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	СтрокаЗаголовка = Дерево.Строки.Добавить();
	СтрокаЗаголовка.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Недавние (%1)'; en = 'Recent (%1)'"), Выборка.Количество());
	СтрокаЗаголовка.КомандаСсылка = "Недавние";
	СтрокаЗаголовка.ЭтоЗаголовок = Истина;
	
	Пока Выборка.Следующий() Цикл
		СтрокаПредмета = СтрокаЗаголовка.Строки.Добавить();
		СтрокаПредмета.Наименование = ОбщегоНазначенияДокументооборотВызовСервера.ПредметСтрокой(Выборка.Объект);
		СтрокаПредмета.КомандаСсылка = Выборка.Объект;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПолучитьВозможныеДокументы(Дерево)
	
	КоличествоТипов = ТипыПредмета.Количество();
	
	СтрокаЗаголовка = Дерево.Строки.Добавить();
	СтрокаЗаголовка.КомандаСсылка = "Возможные";
	СтрокаЗаголовка.ЭтоЗаголовок = Истина;
	СтрокаЗаголовка.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Возможные (%1)'; en = 'Possible (%1)'"), КоличествоТипов);
	
	Для Каждого Строка Из ТипыПредмета Цикл
		СтрокаПредмета = СтрокаЗаголовка.Строки.Добавить();
		СтрокаПредмета.Наименование = Строка.Представление;
		СтрокаПредмета.КомандаСсылка = Строка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПараметрыРазвернутости(Строка, Развернуть)
	
	Если СтруктураРазвернутости = Неопределено Тогда
		СтруктураРазвернутости = Новый Структура;
	КонецЕсли;
	
	СтрокаДерева = ДеревоВариантов.НайтиПоИдентификатору(Строка);
	СтруктураРазвернутости.Вставить(СтрокаДерева.КомандаСсылка,Развернуть);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредметКлиент()
	
	ТекущиеДанные = Элементы.ДеревоВариантов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено 
		ИЛИ ТекущиеДанные.ЭтоЗаголовок Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.КомандаСсылка) = Тип("Строка") 
		И ТекущиеДанные.КомандаСсылка = ВнешнийРесурс Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ДобавлениеВнешнегоРесурсаЗавершение",
			ЭтотОбъект);
		ОткрытьФорму("РегистрСведений.СвязиДокументов.Форма.ФормаВнешнегоРесурса",,
			ЭтаФорма,,,,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
						
	ИначеЕсли ТипЗнч(ТекущиеДанные.КомандаСсылка) = Тип("Строка") Тогда
		ИмяФормыВыбора = ТекущиеДанные.КомандаСсылка + ".ФормаВыбора";
		
		Если ТекущиеДанные.КомандаСсылка = "Справочник.Файлы" Тогда
			ИмяФормыВыбора = "Справочник.Файлы.Форма.ФормаВыбораФайлаВПапках";		
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, ЭтаФорма);
		
	Иначе
		СвязанныйДокумент = ТекущиеДанные.КомандаСсылка;
		
		ТекстОшибки = "";
		ПерейтиКСозданиюСвязи();
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеВнешнегоРесурсаЗавершение(Результат, Параметры)Экспорт 

	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		
		СвязанныйДокумент = Результат.ВнешнийРесурс;
		Комментарий = Результат.Комментарий;
		ТекстОшибки = "";
		
		ПерейтиКСозданиюСвязи();
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда 
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура  ПерейтиКСозданиюСвязи()

	Если ЗначениеЗаполнено(СвязанныйДокумент) Тогда 
		Если Документ = СвязанныйДокумент Тогда 
			ТекстОшибки = НСтр(
				"ru = 'Нельзя установить связь объекта с самим собой. Выберите другой объект для создания связи.'; en = 'You cannot establish a relation of object with itself. Choose a different object to create the relation.'");
			Возврат;	
		КонецЕсли;

		Команды.Готово.Подсказка = НСтр("ru = 'Связать выбранные объекты'; en = 'Relate the selected objects'");
		НастройкиСвязей = СвязиДокументов.ПолучитьНастройкиСвязи(Документ, СвязанныйДокумент);
		ТипыСвязей.Очистить();
		
		Для Каждого НастройкаСвязи Из НастройкиСвязей Цикл 
			
			Если Не СвязиДокументов.ЭтоПодходящийТипСвязи(Документ, СвязанныйДокумент, НастройкаСвязи.ТипСвязи) Тогда
				Продолжить;
			КонецЕсли;

			Если ТипыСвязей.НайтиПоЗначению(НастройкаСвязи.ТипСвязи) = Неопределено Тогда 
				ТипыСвязей.Добавить(НастройкаСвязи.ТипСвязи);
			КонецЕсли;	
		КонецЦикла;	
		
		Если ТипыСвязей.Количество() <> 0 Тогда 
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСозданиеСвязи;	
			Элементы.Готово.Заголовок = НСтр("ru = 'Создать связь'; en = 'Create a relation'"); 
			Элементы.Назад.Видимость = Истина;	
			СвязанныйДокументТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2)'; en = '%1 (%2)'"), СвязанныйДокумент, ТипЗнч(СвязанныйДокумент));
				
			Если ЗначениеЗаполнено(ТекущийТипСвязи) Тогда 
				ЭлементТипСвязи = ТипыСвязей.НайтиПоЗначению(ТекущийТипСвязи);
				
				Если ЭлементТипСвязи <> Неопределено Тогда 
					Элементы.ТипыСвязей.ТекущаяСтрока = ЭлементТипСвязи.ПолучитьИдентификатор();	
				КонецЕсли;	
				
			КонецЕсли;
			
		Иначе 
			ТекстОшибки = НСтр(
				"ru = 'Нельзя установить связь, так как для выбранных документов не настроено ни одного типа связи'; en = 'You cannot establish a relation, as for selected documents not configured any relationship type'");
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПодсказку();
	
	Команды.Готово.Подсказка = НСтр("ru = 'Далее'; en = 'Next'");
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСвязь(ТипСвязи);
	
	РеквизитыВладельцаИзменены = Ложь;
	СвязиДокументов.УстановитьСвязь(Документ,
		Неопределено,
		СвязанныйДокумент,
		ТипСвязи,
		ТекущийПользователь,
		ТекущаяДата(),
		Комментарий);
		
	//Обновим реквизиты связуемых документов
	РеквизитыВладельцаИзменены = СвязиДокументов.УстановитьРеквизитыПриДобавленииСвязи(Документ,
		УникальныйИдентификаторФормыВладельца, ТипСвязи);
	НастройкаСвязи = СвязиДокументов.ПолучитьНастройкуСвязи(Документ, СвязанныйДокумент, ТипСвязи);
	
	Если  НастройкаСвязи <> Неопределено И ЗначениеЗаполнено(НастройкаСвязи.ТипОбратнойСвязи) Тогда
		СвязиДокументов.УстановитьРеквизитыПриДобавленииСвязи(СвязанныйДокумент,,
			НастройкаСвязи.ТипОбратнойСвязи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
